{"slug":"binary/how-to-convert-binary-to-decimal","title":"How to Convert Binary to Decimal","description":"Converting binary to decimal is a common task in computer programming. Binary is a base-2 number system that uses only two digits, 0 and 1. Decimal, on the other hand, is a base-10 number system that uses ten digits, 0 through 9. Converting binary to decimal involves multiplying each digit of the binary number by its corresponding power of 2 and adding up the results.","tags":["binary","decimal"],"date":"2022-01-26T00:00:00.000Z","markdown":"\nConverting [binary][Binary_Number] to [decimal][Decimal_Number] is a common task in computer programming. Binary is a `base-2` number system that uses only two digits, 0 and 1. Decimal, on the other hand, is a `base-10` number system that uses ten digits, 0 through 9. Converting binary to decimal involves multiplying each digit of the binary number by its corresponding power of 2 and adding up the results.\n\n## Conversion\n\nHere's a step-by-step guide on how to convert binary to decimal:\n\n1. Choose the binary number you want to convert to decimal.\n2. Write down the powers of 2 from right to left, starting with $2^0$.\n3. Multiply each digit of the binary number by its corresponding power of 2.\n4. Add up the results from step 3 to get the decimal value.\n\n## Example\n\nLet's walk through an example to illustrate the process. Suppose we want to convert the binary number `1011` to decimal.\n\n1. The binary number we want to convert is 1011.\n2. The powers of 2 from right to left are $2^0$, $2^1$, $2^2$, and $2^3$\n3. We multiply each digit of the binary number by its corresponding power of 2. The results are: $1 \\times 2^0 = 1$, $1 \\times 2^1 = 2$, $0 \\times 2^2 = 0$, and $1 \\times 2^3 = 8$\n4. We add up the results from step 3 to get the decimal value. $1 + 2 + 0 + 8 = 11$ Therefore, the decimal value of the binary number 1011 is 11.\n\n## Binary-Decimal Table\n\nHere's a table that shows the decimal values of the first 16 binary numbers:\n\n| Binary | Decimal |\n| ------ | ------- |\n| 0000   | 0       |\n| 0001   | 1       |\n| 0010   | 2       |\n| 0011   | 3       |\n| 0100   | 4       |\n| 0101   | 5       |\n| 0110   | 6       |\n| 0111   | 7       |\n| 1000   | 8       |\n| 1001   | 9       |\n| 1010   | 10      |\n| 1011   | 11      |\n| 1100   | 12      |\n| 1101   | 13      |\n| 1110   | 14      |\n| 1111   | 15      |\n\n## References\n\n- [Binary Number][Binary_Number]\n- [Decimal Number][Decimal_Number]\n\n<!-- Reference -->\n\n[Binary_Number]: /blog/2024/01/01-what-is-binary-number \"What is a Binary Number?\"\n[Decimal_Number]: /blog/2024/01/01-what-is-decimal-number \"What is a Decimal Number?\"\n"}