{"slug":"decimal/how-to-convert-decimal-to-octal","title":"How to Convert Decimal to Octal","description":"Converting decimal to octal is a common task in computer programming. Decimal is a base-10 number system that uses ten digits, 0 through 9. Octal, on the other hand, is a base-8 number system that uses eight digits, 0 through 7. Converting decimal to octal involves dividing the decimal number by 8 repeatedly and recording the remainder at each step.","tags":["decimal","octal"],"date":"2022-01-26T00:00:00.000Z","markdown":"\nConverting [decimal][Decimal_Number] to [octal][Octal_Number] is a common task in computer programming. Decimal is a `base-10` number system that uses ten digits, 0 through 9. Octal, on the other hand, is a `base-8` number system that uses eight digits, 0 through 7. Converting decimal to octal involves dividing the decimal number by 8 repeatedly and recording the remainder at each step.\n\n## Conversion\n\nHere's a step-by-step guide on how to convert decimal to octal:\n\n1. Choose the decimal number you want to convert to octal.\n2. Divide the decimal number by 8.\n3. Record the remainder (0 through 7).\n4. If the quotient is greater than 0, repeat steps 2 and 3 using the quotient as the new decimal number.\n5. Write the remainders in reverse order to get the octal representation of the decimal number.\n\n## Example\n\nLet's walk through an example to illustrate the process. Suppose we want to convert the decimal number 305 to octal.\n\n1. The decimal number we want to convert is 305.\n2. We divide 305 by 8 to get a quotient of 38 and a remainder of 1.\n3. We record the remainder of 1.\n4. We divide 38 by 8 to get a quotient of 4 and a remainder of 6.\n5. We record the remainder of 6.\n6. We divide 4 by 8 to get a quotient of 0 and a remainder of 4.\n7. We record the remainder of 4.\n8. We write the remainders in reverse order to get the octal representation of 305: 461.\n\n   | Quotient   | Remainder | Octal |\n   | ---------- | --------- | ----- |\n   | $305/8=38$ | 1         | 1     |\n   | $38/8=4$   | 6         | 61    |\n   | $4/8=0$    | 4         | 461   |\n\n## Decimal-Octal Table\n\nHere's a table of decimal numbers and their octal equivalents:\n\n| Decimal | Octal |\n| ------- | ----- |\n| 0       | 0     |\n| 1       | 1     |\n| 2       | 2     |\n| 3       | 3     |\n| 4       | 4     |\n| 5       | 5     |\n| 6       | 6     |\n| 7       | 7     |\n| 8       | 10    |\n\n## References\n\n- [Decimal Number][Decimal_Number]\n- [Octal Number][Octal_Number]\n\n<!-- Reference -->\n\n[Decimal_Number]: /blog/2024/01/01-what-is-decimal-number \"What is a Decimal Number?\"\n[Octal_Number]: /blog/2024/01/01-what-is-octal-number \"What is an Octal Number?\"\n"}