{"slug":"octal/how-to-convert-octal-to-decimal","title":"How to Convert Octal to Decimal","description":"Octal is a base-8 numbering system that uses eight digits, from 0 to 7. Decimal is a base-10 numbering system that uses ten digits, from 0 to 9. In order to convert an octal number to decimal number, you need to multiply each octal digit by its corresponding power of 8 and then add up the results.","tags":["octal","decimal"],"date":"2022-01-26T00:00:00.000Z","markdown":"\n[Octal][Octal_Number] is a `base-8` numbering system that uses eight digits, from 0 to 7. [Decimal][Decimal_Number] is a `base-10` numbering system that uses ten digits, from 0 to 9. In order to convert an octal number to decimal number, you need to multiply each octal digit by its corresponding power of 8 and then add up the results.\n\n## Conversion\n\nHere are the steps to convert an octal number to decimal number:\n\n1. Identify the octal number you want to convert.\n2. Write down the powers of 8. Starting from the rightmost digit, write down the powers of 8 in increasing order from left to right.\n3. Multiply each octal digit by its corresponding power of 8. Starting from the rightmost digit, multiply each octal digit by its corresponding power of 8.\n4. Add up the results. Add up the results from step 3 to get the decimal equivalent of the octal number.\n\n## Example\n\nLet's say we have the octal number 345. To convert this octal number to decimal number, we need to multiply each octal digit by its corresponding power of 8 and then add up the results:\n\n```text\n5 * 1 = 5\n4 * 8 = 32\n3 * 64 = 192\n```\n\nAdding up the results, we get the decimal equivalent of the octal number:\n\n$$5 + 32 + 192 = 229$$\n\nTherefore, the octal number `345` corresponds to the decimal number `229`.\n\n## Octal-Decimal Table\n\nHere's a table of decimal numbers and their octal equivalents:\n\n| Octal | Decimal |\n| ----- | ------- |\n| 0     | 0       |\n| 1     | 1       |\n| 2     | 2       |\n| 3     | 3       |\n| 4     | 4       |\n| 5     | 5       |\n| 6     | 6       |\n| 7     | 7       |\n| 10    | 8       |\n\n## References\n\n- [Decimal Number][Decimal_Number]\n- [Octal Number][Octal_Number]\n\n<!-- Reference -->\n\n[Decimal_Number]: /blog/2024/01/01-what-is-decimal-number \"What is a Decimal Number?\"\n[Octal_Number]: /blog/2024/01/01-what-is-octal-number \"What is an Octal Number?\"\n"}