{"slug":"octal/how-to-convert-octal-to-binary","title":"How to Convert Octal to Binary","description":"Octal is a base-8 numbering system that uses eight digits, from 0 to 7. Binary is a base-2 numbering system that uses two digits, 0 and 1. In order to convert an octal number to binary number, you need to convert each octal digit to its corresponding binary representation.","tags":["octal","binary"],"date":"2022-01-26T00:00:00.000Z","markdown":"\n[Octal][Octal_Number] is a `base-8` numbering system that uses eight digits, from 0 to 7. [Binary][Binary_Number] is a `base-2` numbering system that uses two digits, 0 and 1. In order to convert an octal number to binary number, you need to convert each octal digit to its corresponding binary representation.\n\n## Conversion\n\nHere are the steps to convert an octal number to binary number:\n\n1. Identify the octal number you want to convert.\n2. Convert each octal digit to its corresponding binary representation. You can use the table below to find the corresponding binary representation for each octal digit.\n3. Combine the binary representations to form the final binary number. Starting from the leftmost digit, combine the binary representations of each octal digit to form the final binary number.\n\n## Example\n\nLet's say we have the octal number 345. To convert this octal number to binary number, we need to convert each octal digit to its corresponding binary representation:\n\n```text\n3 -> 011\n4 -> 100\n5 -> 101\n```\n\nCombining these binary representations, we get the final binary number `011100101`.\n\n## Octal-Binary Table\n\n| Octal | Binary |\n| ----- | ------ |\n| 0     | 000    |\n| 1     | 001    |\n| 2     | 010    |\n| 3     | 011    |\n| 4     | 100    |\n| 5     | 101    |\n| 6     | 110    |\n| 7     | 111    |\n\n## References\n\n- [Binary Number][Binary_Number]\n- [Octal Number][Octal_Number]\n\n<!-- Reference -->\n\n[Binary_Number]: /blog/2024/01/01-what-is-binary-number \"What is a Binary Number?\"\n[Octal_Number]: /blog/2024/01/01-what-is-octal-number \"What is an Octal Number?\"\n"}