{"slug":"hexadecimal/how-to-convert-hexadecimal-to-octal","title":"How to Convert Hexadecimal to Octal","description":"Converting hexadecimal to octal is a common task in computer programming. Hexadecimal is a base-16 number system that uses sixteen digits, 0 through 9 and A through F. Octal, on the other hand, is a base-8 number system that uses eight digits, 0 through 7. Converting hexadecimal to octal involves converting the hexadecimal number to binary, and then converting the binary number to octal.","tags":["hexadecimal","octal"],"date":"2022-01-26T00:00:00.000Z","markdown":"\nConverting [hexadecimal][Hexadecimal_Number] to [octal][Octal_Number] is a common task in computer programming. Hexadecimal is a `base-16` number system that uses sixteen digits, 0 through 9 and A through F. Octal, on the other hand, is a `base-8` number system that uses eight digits, 0 through 7. Converting hexadecimal to octal involves converting the hexadecimal number to [binary][Binary_Number], and then converting the binary number to octal.\n\n## Conversion\n\nHere's a step-by-step guide on how to convert hexadecimal to octal:\n\n1. Choose the hexadecimal number you want to convert to octal.\n2. Convert the hexadecimal number to binary using the table below.\n3. Group the binary digits into groups of three, starting from the rightmost digit. If the leftmost group has less than three digits, add leading zeros to make it a group of three.\n4. Convert each group of three binary digits to its octal equivalent using the table below.\n5. Write the octal equivalent of each group of three binary digits in order to get the octal representation of the binary number.\n\n## Example\n\nLet's walk through an example to illustrate the process. Suppose we want to convert the hexadecimal number 2A to octal.\n\n1. The hexadecimal number we want to convert is `2A`.\n2. We convert the hexadecimal number to binary using the table below: 0010 1010.\n3. We group the binary digits into groups of three: 000 101 010.\n4. We convert each group of three binary digits to its octal equivalent using the table below. 000 = 0, 101 = 5, 010 = 2.\n5. We write the octal equivalent of each group of three binary digits in order to get the octal representation of the binary number: 052.\n\n## Hexadecimal-Binary Table\n\n| Hexadecimal | Binary |\n| ----------- | ------ |\n| 0           | 0000   |\n| 1           | 0001   |\n| 2           | 0010   |\n| 3           | 0011   |\n| 4           | 0100   |\n| 5           | 0101   |\n| 6           | 0110   |\n| 7           | 0111   |\n| 8           | 1000   |\n| 9           | 1001   |\n| A           | 1010   |\n| B           | 1011   |\n| C           | 1100   |\n| D           | 1101   |\n| E           | 1110   |\n| F           | 1111   |\n\n## Binary-Octal Table\n\n| Binary | Octal |\n| ------ | ----- |\n| 000    | 0     |\n| 001    | 1     |\n| 010    | 2     |\n| 011    | 3     |\n| 100    | 4     |\n| 101    | 5     |\n| 110    | 6     |\n| 111    | 7     |\n\n## References\n\n- [Binary Number][Binary_Number]\n- [Hexadecimal Number][Hexadecimal_Number]\n- [Octal Number][Octal_Number]\n\n<!-- Reference -->\n\n[Binary_Number]: /blog/2024/01/01-what-is-binary-number \"What is a Binary Number?\"\n[Hexadecimal_Number]: /blog/2024/01/01-what-is-hexadecimal-number \"What is a Hexadecimal Number?\"\n[Octal_Number]: /blog/2024/01/01-what-is-octal-number \"What is an Octal Number?\"\n"}