{"slug":"hexadecimal/how-to-convert-hexadecimal-to-decimal","title":"How to Convert Hexadecimal to Decimal","description":"Converting hexadecimal to decimal is a common task in computer programming. Hexadecimal is a base-16 number system that uses sixteen digits, 0 through 9 and A through F. Decimal, on the other hand, is a base-10 number system that uses ten digits, 0 through 9. Converting hexadecimal to decimal involves converting each hexadecimal digit to its corresponding decimal value.","tags":["hexadecimal","decimal"],"date":"2022-01-26T00:00:00.000Z","markdown":"\nConverting [hexadecimal][Hexadecimal_Number] to [decimal][Decimal_Number] is a common task in computer programming. Hexadecimal is a `base-16` number system that uses sixteen digits, 0 through 9 and A through F. Decimal, on the other hand, is a `base-10` number system that uses ten digits, 0 through 9. Converting hexadecimal to decimal involves converting each hexadecimal digit to its corresponding decimal value.\n\n## Conversion\n\nHere's a step-by-step guide on how to convert hexadecimal to decimal:\n\n1. Choose the hexadecimal number you want to convert to decimal.\n2. Convert each hexadecimal digit to its corresponding decimal value using the below table.\n3. Write the decimal equivalent of each hexadecimal digit in order to get the decimal representation of the hexadecimal number.\n\n## Example\n\nLet's walk through an example to illustrate the process. Suppose we want to convert the hexadecimal number 2A to decimal.\n\n1. The hexadecimal number we want to convert is 2A.\n2. We convert each hexadecimal digit to its corresponding decimal value using the below table.\n3. We write the decimal equivalent of each hexadecimal digit in order to get the decimal representation of 2A: 42.\n\n## Decimal-Hexadecimal Table\n\nHere's a table that shows the decimal and hexadecimal values of the first 16 numbers:\n\n| Hexadecimal | Decimal |\n| ----------- | ------- |\n| 0           | 0       |\n| 1           | 1       |\n| 2           | 2       |\n| 3           | 3       |\n| 4           | 4       |\n| 5           | 5       |\n| 6           | 6       |\n| 7           | 7       |\n| 8           | 8       |\n| 9           | 9       |\n| A           | 10      |\n| B           | 11      |\n| C           | 12      |\n| D           | 13      |\n| E           | 14      |\n| F           | 15      |\n\n## References\n\n- [Decimal Number][Decimal_Number]\n- [Hexadecimal Number][Hexadecimal_Number]\n\n<!-- Reference -->\n\n[Decimal_Number]: /blog/2024/01/01-what-is-decimal-number \"What is a Decimal Number?\"\n[Hexadecimal_Number]: /blog/2024/01/01-what-is-hexadecimal-number \"What is a Hexadecimal Number?\"\n"}