{"slug":"hexadecimal/how-to-convert-hexadecimal-to-binary","title":"How to Convert Hexadecimal to Binary","description":"Converting hexadecimal to binary is a common task in computer programming. Hexadecimal is a base-16 number system that uses sixteen digits, 0 through 9 and A through F. Binary, on the other hand, is a base-2 number system that uses only two digits, 0 and 1. Converting hexadecimal to binary involves converting each hexadecimal digit to its binary equivalent.","tags":["hexadecimal","binary"],"date":"2022-01-26T00:00:00.000Z","markdown":"\nConverting [hexadecimal][Hexadecimal_Number] to [binary][Binary_Number] is a common task in computer programming. Hexadecimal is a `base-16` number system that uses sixteen digits, 0 through 9 and A through F. Binary, on the other hand, is a `base-2` number system that uses only two digits, 0 and 1. Converting hexadecimal to binary involves converting each hexadecimal digit to its binary equivalent.\n\n## Conversion\n\nHere's a step-by-step guide on how to convert hexadecimal to binary:\n\n1. Choose the hexadecimal number you want to convert to binary.\n2. Convert each hexadecimal digit to its binary equivalent using the below table.\n3. Write the binary equivalent of each hexadecimal digit in order to get the binary representation of the hexadecimal number.\n\n## Example\n\nLet's walk through an example to illustrate the process. Suppose we want to convert the hexadecimal number 2A to binary.\n\n1. The hexadecimal number we want to convert is 2A.\n2. We convert each hexadecimal digit to its binary equivalent using the table below.\n3. We write the binary equivalent of each hexadecimal digit in order to get the binary representation of 2A: 00101010.\n\n## Binary-Hexadecimal Table\n\n| Hexadecimal | Binary |\n| ----------- | ------ |\n| 0           | 0000   |\n| 1           | 0001   |\n| 2           | 0010   |\n| 3           | 0011   |\n| 4           | 0100   |\n| 5           | 0101   |\n| 6           | 0110   |\n| 7           | 0111   |\n| 8           | 1000   |\n| 9           | 1001   |\n| A           | 1010   |\n| B           | 1011   |\n| C           | 1100   |\n| D           | 1101   |\n| E           | 1110   |\n| F           | 1111   |\n\n## References\n\n- [Binary Number][Binary_Number]\n- [Hexadecimal Number][Hexadecimal_Number]\n\n<!-- Reference -->\n\n[Binary_Number]: /blog/2024/01/01-what-is-binary-number \"What is a Binary Number?\"\n[Hexadecimal_Number]: /blog/2024/01/01-what-is-hexadecimal-number \"What is a Hexadecimal Number?\"\n"}