[{"slug":"ascii/how-to-convert-ascii-to-binary","title":"How to Convert ASCII to Binary","description":"Converting ASCII to binary is a common task in computer programming. ASCII is a character encoding standard that assigns a unique number to each character. Binary, on the other hand, is a base-2 number system that uses only two digits, 0 and 1. Converting ASCII to binary involves converting each character to its corresponding binary value.","tags":["ascii","binary"],"date":"2022-01-26T00:00:00.000Z"},{"slug":"ascii/how-to-convert-ascii-to-decimal","title":"How to Convert ASCII to Decimal","description":"Converting ASCII to decimal is a common task in computer programming. ASCII is a character encoding standard that assigns a unique number to each character. Decimal, on the other hand, is a base-10 number system that uses ten digits, 0 through 9. Converting ASCII to decimal involves converting each character to its corresponding decimal value.","tags":["ascii","decimal"],"date":"2022-01-26T00:00:00.000Z"},{"slug":"ascii/how-to-convert-ascii-to-hexadecimal","title":"How to Convert ASCII to Hexadecimal","description":"Converting ASCII to hexadecimal is a common task in computer programming. ASCII is a character encoding standard that assigns a unique number to each character. Hexadecimal, on the other hand, is a base-16 number system that uses sixteen digits, 0 through 9 and A through F. Converting ASCII to hexadecimal involves converting each character to its corresponding hexadecimal value.","tags":["ascii","hexadecimal"],"date":"2022-01-26T00:00:00.000Z"},{"slug":"ascii/how-to-convert-ascii-to-octal","title":"How to Convert ASCII to Octal","description":"Converting ASCII to octal is a common task in computer programming. ASCII is a character encoding standard that assigns a unique number to each character. Octal, on the other hand, is a base-8 number system that uses eight digits, 0 through 7. Converting ASCII to octal involves converting each character to its corresponding octal value.","tags":["ascii","octal"],"date":"2022-01-26T00:00:00.000Z"},{"slug":"ascii/what-is-ascii-number","title":"What is ASCII Number?","description":"ASCII stands for American Standard Code for Information Interchange. It is a character encoding standard that assigns unique numbers to each character in the English language. ASCII numbers are used to represent text in computers, communication equipment, and other devices that use text.","tags":["ascii"],"date":"2022-01-26T00:00:00.000Z"},{"slug":"binary/how-to-convert-binary-to-ascii","title":"How to Convert Binary to ASCII","description":"Converting binary to ASCII is a common task in computer programming. Binary is a base-2 number system that uses only two digits, 0 and 1. ASCII, on the other hand, is a character encoding standard that assigns a unique number to each character. Converting binary to ASCII involves converting each group of 8 bits (1 byte) to its corresponding ASCII character.","tags":["binary","ascii"],"date":"2022-01-26T00:00:00.000Z"},{"slug":"decimal/how-to-convert-decimal-to-ascii","title":"How to Convert Decimal to ASCII","description":"Converting decimal to ASCII is a common task in computer programming. ASCII is a character encoding standard that assigns a unique number to each character. Decimal, on the other hand, is a base-10 number system that uses ten digits, 0 through 9. Converting decimal to ASCII involves looking up the ASCII character corresponding to each decimal value using an ASCII table.","tags":["ascii","decimal"],"date":"2022-01-26T00:00:00.000Z"},{"slug":"hexadecimal/how-to-convert-hexadecimal-to-ascii","title":"How to Convert Hexadecimal to ASCII","description":"Converting hexadecimal to ASCII is a common task in computer programming. Hexadecimal is a base-16 number system that uses sixteen digits, 0 through 9 and A through F. Decimal is a base-10 number system that uses ten digits, 0 through 9. ASCII is a character encoding standard that assigns a unique number to each character. Converting hexadecimal  to ASCII involves converting the hexadecimal number to decimal, and then looking up the ASCII character corresponding to each decimal value using an ASCII table.","tags":["hexadecimal","ascii"],"date":"2022-01-26T00:00:00.000Z"},{"slug":"octal/how-to-convert-octal-to-ascii","title":"How to Convert Octal to ASCII","description":"ASCII is a character encoding standard that assigns unique numbers to each character. Octal is a base-8 numbering system that uses eight digits, from 0 to 7. In order to convert an octal number to ASCII text, you need to convert each octal digit to its corresponding ASCII character.","tags":["octal","ascii"],"date":"2022-01-26T00:00:00.000Z"}]